# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0 за формулами
# 𝑥1,2 =  −𝑏± b2−4ac−−−−−−−√ / 2𝑎. Значення a, b та c вводяться з клавіатури. Для знаходження кореня використовуйте
# оператор зведення в ступінь, а не функцію math.sqrt, щоб отримати комплексні числа у випадку, якщо вираз під коренем
# негативний.

a = int(input('Введіть число а: '))
b = int(input('Введіть число b: '))
c = int(input('Введіть число c: '))

x1 = ((-b) + (b**2 - 4 * a * c) ** 0.5) / (2 * a)
x2 = ((-b) - (b**2 - 4 * a * c) ** 0.5) / (2 * a)

print(a * (x1**2) + b * x1 + c)
print(a * (x2**2) + b * x2 + c)
